ByteWelder/Tactility/Platforms/platform-esp32/source/drivers/usb/esp32_usb_hid_device.cpp
#include <sdkconfig.h>
#if CONFIG_SOC_USB_OTG_SUPPORTED && CONFIG_TINYUSB_HID_COUNT

#include <tactility/device.h>
#include <tactility/driver.h>
#include <tactility/drivers/esp32_usbdevice.h>
#include <tactility/drivers/usb_device_controller.h>
#include <tactility/drivers/usb_hid_device.h>
#include <tactility/log.h>

#include <tinyusb.h>
#include <tusb.h>

#include <freertos/FreeRTOS.h>
#include <freertos/task.h>

#include <cstring>

#if CONFIG_TINYUSB_CDC_ENABLED
#include <tusb_cdc_acm.h>
#include <esp_log.h>
#include <cstdarg>
#include <cstdio>
#endif

#define TAG "esp32_usb_hid_device"
#define GET_CONFIG(device) ((const Esp32UsbDeviceChildConfig*)(device)->config)

// ---- HID Report Maps ----
// Byte-identical to esp32_ble_hid.cpp's hid_rpt_map_* tables - HID report descriptors are
// transport-independent (same USB HID Usage Tables spec applies to both USB and BLE HID), so
// the same report layout/report-ID scheme works verbatim over either transport. Keeping USB and
// BLE HID on identical report maps means UsbHidDeviceMode and BtHidDeviceMode produce
// byte-for-byte identical reports for the same mode, so callers that build reports once can
// send them down either transport.

// Keyboard (report ID 1, 8 bytes) + Consumer (report ID 2, 2 bytes)
static const uint8_t hid_rpt_map_kb_consumer[] = {
    0x05, 0x01, 0x09, 0x06, 0xA1, 0x01,
    0x85, 0x01,
    0x05, 0x07, 0x19, 0xE0, 0x29, 0xE7, 0x15, 0x00, 0x25, 0x01,
    0x75, 0x01, 0x95, 0x08, 0x81, 0x02,
    0x75, 0x08, 0x95, 0x01, 0x81, 0x01,
    0x05, 0x08, 0x19, 0x01, 0x29, 0x05, 0x75, 0x01, 0x95, 0x05, 0x91, 0x02,
    0x75, 0x03, 0x95, 0x01, 0x91, 0x01,
    0x15, 0x00, 0x25, 0x73, 0x05, 0x07, 0x19, 0x00, 0x29, 0x73,
    0x75, 0x08, 0x95, 0x06, 0x81, 0x00,
    0xC0,
    0x05, 0x0C, 0x09, 0x01, 0xA1, 0x01,
    0x85, 0x02,
    0x15, 0x00, 0x26, 0xFF, 0x03, 0x19, 0x00, 0x2A, 0xFF, 0x03,
    0x75, 0x10, 0x95, 0x01, 0x81, 0x00,
    0xC0,
};

// Mouse only (report ID 1, 4 bytes)
static const uint8_t hid_rpt_map_mouse[] = {
    0x05, 0x01, 0x09, 0x02, 0xA1, 0x01,
    0x85, 0x01,
    0x09, 0x01, 0xA1, 0x00,
    0x05, 0x09, 0x19, 0x01, 0x29, 0x05,
    0x15, 0x00, 0x25, 0x01, 0x95, 0x05, 0x75, 0x01, 0x81, 0x02,
    0x95, 0x01, 0x75, 0x03, 0x81, 0x01,
    0x05, 0x01, 0x09, 0x30, 0x09, 0x31, 0x09, 0x38,
    0x15, 0x81, 0x25, 0x7F, 0x75, 0x08, 0x95, 0x03, 0x81, 0x06,
    0xC0, 0xC0,
};

// Keyboard + Consumer + Mouse (report IDs 1, 2, 3)
static const uint8_t hid_rpt_map_kb_mouse[] = {
    0x05, 0x01, 0x09, 0x06, 0xA1, 0x01,
    0x85, 0x01,
    0x05, 0x07, 0x19, 0xE0, 0x29, 0xE7, 0x15, 0x00, 0x25, 0x01,
    0x75, 0x01, 0x95, 0x08, 0x81, 0x02,
    0x75, 0x08, 0x95, 0x01, 0x81, 0x01,
    0x05, 0x08, 0x19, 0x01, 0x29, 0x05, 0x75, 0x01, 0x95, 0x05, 0x91, 0x02,
    0x75, 0x03, 0x95, 0x01, 0x91, 0x01,
    0x15, 0x00, 0x25, 0x73, 0x05, 0x07, 0x19, 0x00, 0x29, 0x73,
    0x75, 0x08, 0x95, 0x06, 0x81, 0x00,
    0xC0,
    0x05, 0x0C, 0x09, 0x01, 0xA1, 0x01,
    0x85, 0x02,
    0x15, 0x00, 0x26, 0xFF, 0x03, 0x19, 0x00, 0x2A, 0xFF, 0x03,
    0x75, 0x10, 0x95, 0x01, 0x81, 0x00,
    0xC0,
    0x05, 0x01, 0x09, 0x02, 0xA1, 0x01,
    0x85, 0x03,
    0x09, 0x01, 0xA1, 0x00,
    0x05, 0x09, 0x19, 0x01, 0x29, 0x05,
    0x15, 0x00, 0x25, 0x01, 0x95, 0x05, 0x75, 0x01, 0x81, 0x02,
    0x95, 0x01, 0x75, 0x03, 0x81, 0x01,
    0x05, 0x01, 0x09, 0x30, 0x09, 0x31, 0x09, 0x38,
    0x15, 0x81, 0x25, 0x7F, 0x75, 0x08, 0x95, 0x03, 0x81, 0x06,
    0xC0, 0xC0,
};

// Gamepad only (report ID 1, 8 bytes)
static const uint8_t hid_rpt_map_gamepad[] = {
    0x05, 0x01, 0x09, 0x05, 0xA1, 0x01,
    0x85, 0x01,
    0x05, 0x09, 0x19, 0x01, 0x29, 0x10,
    0x15, 0x00, 0x25, 0x01, 0x75, 0x01, 0x95, 0x10, 0x81, 0x02,
    0x05, 0x01, 0x09, 0x30, 0x09, 0x31, 0x09, 0x32, 0x09, 0x35, 0x09, 0x33, 0x09, 0x34,
    0x15, 0x81, 0x25, 0x7F, 0x75, 0x08, 0x95, 0x06, 0x81, 0x02,
    0xC0,
};

// Report IDs, matching the *_map tables above.
static constexpr uint8_t REPORT_ID_KEYBOARD = 1;
static constexpr uint8_t REPORT_ID_CONSUMER = 2;
static constexpr uint8_t REPORT_ID_MOUSE_SOLO = 1;   // USB_HID_DEVICE_MODE_MOUSE
static constexpr uint8_t REPORT_ID_MOUSE_COMBO = 3;  // USB_HID_DEVICE_MODE_KEYBOARD_MOUSE
static constexpr uint8_t REPORT_ID_GAMEPAD = 1;

// Active mode/report-map state - the report descriptor TinyUSB serves via
// tud_hid_descriptor_report_cb() must match whichever mode start() was last called with, since
// (unlike BLE's mutable GATT) USB's descriptor is fixed for the lifetime of one claim()
// session; switching modes means stop() + start() with the new mode, re-enumerating.
static enum UsbHidDeviceMode active_mode = USB_HID_DEVICE_MODE_KEYBOARD;

static const uint8_t* active_report_map() {
    switch (active_mode) {
        case USB_HID_DEVICE_MODE_MOUSE:          return hid_rpt_map_mouse;
        case USB_HID_DEVICE_MODE_KEYBOARD_MOUSE:  return hid_rpt_map_kb_mouse;
        case USB_HID_DEVICE_MODE_GAMEPAD:        return hid_rpt_map_gamepad;
        default:                                 return hid_rpt_map_kb_consumer; // KEYBOARD
    }
}

static size_t active_report_map_len() {
    switch (active_mode) {
        case USB_HID_DEVICE_MODE_MOUSE:          return sizeof(hid_rpt_map_mouse);
        case USB_HID_DEVICE_MODE_KEYBOARD_MOUSE:  return sizeof(hid_rpt_map_kb_mouse);
        case USB_HID_DEVICE_MODE_GAMEPAD:        return sizeof(hid_rpt_map_gamepad);
        default:                                 return sizeof(hid_rpt_map_kb_consumer);
    }
}

// Per-mode default product name and idProduct offset. Distinct idProduct per mode matters more
// than it might seem: most hosts (Windows in particular) cache device metadata - including
// which icon/appearance to show - keyed by VID/PID/serial, and a HID descriptor swap alone
// isn't always enough to make the host re-read it on a fast re-enumeration. Giving each mode
// its own PID makes the host treat a mode switch as connecting a genuinely different device,
// which reliably clears the stale-appearance problem (was previously showing "Keyboard" for
// every mode almost all the time).
static const char* default_name_for_mode(enum UsbHidDeviceMode mode) {
    switch (mode) {
        case USB_HID_DEVICE_MODE_MOUSE:          return "Tactility Mouse";
        case USB_HID_DEVICE_MODE_KEYBOARD_MOUSE:  return "Tactility Keyboard+Mouse";
        case USB_HID_DEVICE_MODE_GAMEPAD:        return "Tactility Gamepad";
        default:                                 return "Tactility Keyboard"; // KEYBOARD
    }
}

static uint16_t product_id_for_mode(enum UsbHidDeviceMode mode) {
    switch (mode) {
        case USB_HID_DEVICE_MODE_MOUSE:          return 0x4006;
        case USB_HID_DEVICE_MODE_KEYBOARD_MOUSE:  return 0x4007;
        case USB_HID_DEVICE_MODE_GAMEPAD:        return 0x4008;
        default:                                 return 0x4004; // KEYBOARD (unchanged - existing PID)
    }
}

// Set via usb_hid_device_set_name() before start(); empty means "use the mode's default name".
// Mirrors bluetooth_set_device_name()'s pattern of being set once before starting the profile.
static char custom_name[32] = {};

// Composite config: interface 0-1 = CDC ACM (notif + data), interface 2 = HID. Tab5 (and any
// board where the same physical USB-C port carries both the programming/monitor connection and
// the native OTG device-mode peripheral - see esp32_usb_device_controller.cpp's
// route_phy_for_device_mode) loses its console entirely the moment HID claims the port, since
// TinyUSB device mode and the previous serial link can't coexist on the same wire. Compositing a
// CDC ACM interface into the same descriptor keeps a console reachable (as a USB serial device)
// for as long as HID is active. When CONFIG_TINYUSB_CDC_ENABLED isn't set (older/other boards
// where HID doesn't need this), this falls back to the plain HID-only descriptor.
#if CONFIG_TINYUSB_CDC_ENABLED
#define HID_ITF_NUM 2
#define HID_EP_NOTIF 0x83
#define HID_EP_CDC_OUT 0x02
#define HID_EP_CDC_IN 0x82
#define HID_EP_REPORT 0x81
#else
#define HID_ITF_NUM 0
#define HID_EP_REPORT 0x81
#endif

// The report descriptor length varies by mode (KEYBOARD_MOUSE's combined map is the largest),
// so the config descriptor's total length is computed at claim time in build_hid_config(),
// not as a compile-time constant like the old single-report-descriptor version.

