ByteWelder/Tactility/Platforms/platform-esp32/source/drivers/usb/esp32_usb_hid_device.cpp
// Built fresh in start() (see build_hid_device_descriptor()) so idProduct/iProduct can vary per
// mode - see default_name_for_mode()/product_id_for_mode() above for why.
static tusb_desc_device_t hid_device_descriptor = {
    .bLength            = sizeof(tusb_desc_device_t),
    .bDescriptorType    = TUSB_DESC_DEVICE,
    .bcdUSB             = 0x0200,
#if CONFIG_TINYUSB_CDC_ENABLED
    // CDC composite devices must advertise the IAD (Interface Association Descriptor) class at
    // the device level so hosts group the CDC notif+data interfaces correctly.
    .bDeviceClass       = TUSB_CLASS_MISC,
    .bDeviceSubClass    = MISC_SUBCLASS_COMMON,
    .bDeviceProtocol    = MISC_PROTOCOL_IAD,
#else
    .bDeviceClass       = TUSB_CLASS_UNSPECIFIED,
    .bDeviceSubClass    = 0x00,
    .bDeviceProtocol    = 0x00,
#endif
    .bMaxPacketSize0    = CFG_TUD_ENDPOINT0_SIZE,
    .idVendor           = 0x303A, // Espressif VID
    .idProduct          = 0x4004, // overwritten per-mode in start()
    .bcdDevice          = 0x0100,
    .iManufacturer      = 0x01,
    .iProduct           = 0x02,
    .iSerialNumber      = 0x03,
    .bNumConfigurations = 0x01,
};

#if (TUD_OPT_HIGH_SPEED)
static const tusb_desc_device_qualifier_t hid_device_qualifier = {
    .bLength            = sizeof(tusb_desc_device_qualifier_t),
    .bDescriptorType    = TUSB_DESC_DEVICE_QUALIFIER,
    .bcdUSB             = 0x0200,
    .bDeviceClass       = TUSB_CLASS_UNSPECIFIED,
    .bDeviceSubClass    = 0x00,
    .bDeviceProtocol    = 0x00,
    .bMaxPacketSize0    = CFG_TUD_ENDPOINT0_SIZE,
    .bNumConfigurations = 0x01,
    .bReserved          = 0x00,
};
#endif

static const char hid_langid_descriptor[] = { 0x09, 0x04 };
// index 2 (iProduct) is overwritten per-mode/per-custom-name in start(), see
// build_hid_device_descriptor().
static char hid_product_string[sizeof(custom_name)] = "Tactility Keyboard";
// index 4 is the HID interface string, read directly by some HID apps/testers (gamepad
// testers, joystick tools) instead of iProduct (index 2) - same class of bug found and fixed
// in the MIDI driver, where the interface string was a hardcoded generic "MIDI" placeholder
// instead of the real product name. Point it at the same buffer as iProduct so both stay in
// sync with whatever mode/custom name is active.
static const char* hid_string_descriptor[] = {
    hid_langid_descriptor, "Tactility", hid_product_string, "123456", hid_product_string,
};

// Built fresh in start(), sized for the active mode's report map. TinyUSB only reads this once
// during tinyusb_driver_install() (inside usb_device_controller_claim()), so it's safe to
// mutate between claim sessions (i.e. stop() + start() with a different mode) as long as it's
// finalized before claim() is called.
//
// Guarded by !CONFIG_TINYUSB_CDC_ENABLED (mirroring the CDC variant's own guard below) rather
// than being compiled unconditionally: on any board with CDC enabled (Tab5 always does, see
// device.py), hid_device_start() only ever takes the CDC branch, leaving this variant
// genuinely dead code for that build - left ungated it, it still compiled, but as an unused
// static function warning.
#if !CONFIG_TINYUSB_CDC_ENABLED
static uint8_t hid_configuration_descriptor[TUD_CONFIG_DESC_LEN + TUD_HID_DESC_LEN];

static void build_hid_config() {
    const size_t total_len = TUD_CONFIG_DESC_LEN + TUD_HID_DESC_LEN;
    const uint8_t config[] = {
        TUD_CONFIG_DESCRIPTOR(1, HID_ITF_NUM + 1, 0, total_len, TUSB_DESC_CONFIG_ATT_REMOTE_WAKEUP, 100),
    };
    const uint8_t hid_itf[] = {
        TUD_HID_DESCRIPTOR(HID_ITF_NUM, 4, HID_ITF_PROTOCOL_NONE, active_report_map_len(), HID_EP_REPORT, 16, 10),
    };
    memcpy(hid_configuration_descriptor, config, sizeof(config));
    memcpy(hid_configuration_descriptor + sizeof(config), hid_itf, sizeof(hid_itf));
}
#endif

#if CONFIG_TINYUSB_CDC_ENABLED
static uint8_t hid_cdc_configuration_descriptor[TUD_CONFIG_DESC_LEN + TUD_CDC_DESC_LEN + TUD_HID_DESC_LEN];

static void build_hid_cdc_config() {
    const size_t total_len = TUD_CONFIG_DESC_LEN + TUD_CDC_DESC_LEN + TUD_HID_DESC_LEN;
    const uint8_t config[] = {
        TUD_CONFIG_DESCRIPTOR(1, HID_ITF_NUM + 1, 0, total_len, TUSB_DESC_CONFIG_ATT_REMOTE_WAKEUP, 100),
    };
    const uint8_t cdc_itf[] = {
        TUD_CDC_DESCRIPTOR(0, 4, HID_EP_NOTIF, 8, HID_EP_CDC_OUT, HID_EP_CDC_IN, 64),
    };
    const uint8_t hid_itf[] = {
        TUD_HID_DESCRIPTOR(HID_ITF_NUM, 4, HID_ITF_PROTOCOL_NONE, active_report_map_len(), HID_EP_REPORT, 16, 10),
    };
    uint8_t* p = hid_cdc_configuration_descriptor;
    memcpy(p, config, sizeof(config)); p += sizeof(config);
    memcpy(p, cdc_itf, sizeof(cdc_itf)); p += sizeof(cdc_itf);
    memcpy(p, hid_itf, sizeof(hid_itf));
}
#endif

static tinyusb_config_t hid_tusb_cfg = {
    .device_descriptor = &hid_device_descriptor,
    .string_descriptor = hid_string_descriptor,
    .string_descriptor_count = sizeof(hid_string_descriptor) / sizeof(hid_string_descriptor[0]),
    .external_phy = false,
#if (TUD_OPT_HIGH_SPEED)
    .fs_configuration_descriptor = nullptr, // set in start(), see build_hid_config()/build_hid_cdc_config()
    .hs_configuration_descriptor = nullptr,
    .qualifier_descriptor = &hid_device_qualifier,
#else
    .configuration_descriptor = nullptr, // set in start()
#endif
    .self_powered = false,
    .vbus_monitor_io = 0,
};

// ---- TinyUSB HID callbacks (required by the TinyUSB HID class driver) ----

extern "C" {

uint8_t const* tud_hid_descriptor_report_cb(uint8_t instance) {
    (void)instance;
    return active_report_map();
}

uint16_t tud_hid_get_report_cb(uint8_t instance, uint8_t report_id, hid_report_type_t report_type,
                               uint8_t* buffer, uint16_t reqlen) {
    (void)instance; (void)report_id; (void)report_type; (void)buffer; (void)reqlen;
    return 0;
}

void tud_hid_set_report_cb(uint8_t instance, uint8_t report_id, hid_report_type_t report_type,
                           uint8_t const* buffer, uint16_t bufsize) {
    (void)instance; (void)report_id; (void)report_type; (void)buffer; (void)bufsize;
    // LED state (caps/num/scroll lock) - not currently surfaced to callers.
}

