ByteWelder/Tactility/Platforms/platform-esp32/source/drivers/usb/esp32_usb_hid_device.cpp
} // extern "C"

// ---- HID device API ----

#if CONFIG_TINYUSB_CDC_ENABLED
static bool cdc_console_installed = false;
static vprintf_like_t previous_vprintf = nullptr;

// Mirrors every log line to the CDC ACM interface in addition to whatever the log vprintf
// hook already does (UART0, ...) - deliberately additive rather than esp_tinyusb's own
// esp_tusb_init_console(), which freopen()s stdout/stderr and would replace the existing
// console instead of adding a second one alongside it.
static int cdc_mirroring_vprintf(const char* fmt, va_list args) {
    int result = previous_vprintf ? previous_vprintf(fmt, args) : vprintf(fmt, args);

    if (tud_cdc_connected()) {
        char buf[256];
        va_list args_copy;
        va_copy(args_copy, args);
        int len = vsnprintf(buf, sizeof(buf), fmt, args_copy);
        va_end(args_copy);
        if (len > 0) {
            size_t to_write = static_cast<size_t>(len) < sizeof(buf) ? static_cast<size_t>(len) : sizeof(buf) - 1;
            tinyusb_cdcacm_write_queue(TINYUSB_CDC_ACM_0, reinterpret_cast<const uint8_t*>(buf), to_write);
            tinyusb_cdcacm_write_flush(TINYUSB_CDC_ACM_0, 0);
        }
    }
    return result;
}

static void install_cdc_console() {
    const tinyusb_config_cdcacm_t acm_cfg = {
        .usb_dev = TINYUSB_USBDEV_0,
        .cdc_port = TINYUSB_CDC_ACM_0,
        .callback_rx = nullptr,
        .callback_rx_wanted_char = nullptr,
        .callback_line_state_changed = nullptr,
        .callback_line_coding_changed = nullptr,
    };
    if (tusb_cdc_acm_init(&acm_cfg) != ESP_OK) {
        LOG_E(TAG, "tusb_cdc_acm_init failed - CDC console unavailable");
        return;
    }
    previous_vprintf = esp_log_set_vprintf(cdc_mirroring_vprintf);
    cdc_console_installed = true;
}

static void uninstall_cdc_console() {
    if (!cdc_console_installed) return;
    esp_log_set_vprintf(previous_vprintf ? previous_vprintf : vprintf);
    previous_vprintf = nullptr;
    tusb_cdc_acm_deinit(TINYUSB_CDC_ACM_0);
    cdc_console_installed = false;
}
#endif

// Fills in idProduct/iProduct for the given mode, honoring a set_name() override if one was
// set. Must run before every claim() - the name/PID need to match whatever mode is about to
// start, not whatever they were left as from a previous session.
static void build_hid_device_descriptor(enum UsbHidDeviceMode mode) {
    hid_device_descriptor.idProduct = product_id_for_mode(mode);
    const char* name = custom_name[0] ? custom_name : default_name_for_mode(mode);
    strncpy(hid_product_string, name, sizeof(hid_product_string) - 1);
    hid_product_string[sizeof(hid_product_string) - 1] = '\0';
}

static error_t hid_device_start(struct Device* device, enum UsbHidDeviceMode mode) {
    active_mode = mode;
    build_hid_device_descriptor(mode);

#if CONFIG_TINYUSB_CDC_ENABLED
    build_hid_cdc_config();
#if (TUD_OPT_HIGH_SPEED)
    hid_tusb_cfg.fs_configuration_descriptor = hid_cdc_configuration_descriptor;
    hid_tusb_cfg.hs_configuration_descriptor = hid_cdc_configuration_descriptor;
#else
    hid_tusb_cfg.configuration_descriptor = hid_cdc_configuration_descriptor;
#endif
#else
    build_hid_config();
#if (TUD_OPT_HIGH_SPEED)
    hid_tusb_cfg.fs_configuration_descriptor = hid_configuration_descriptor;
    hid_tusb_cfg.hs_configuration_descriptor = hid_configuration_descriptor;
#else
    hid_tusb_cfg.configuration_descriptor = hid_configuration_descriptor;
#endif
#endif

    auto* controller = device_get_parent(device);
    error_t err = usb_device_controller_claim(controller, USB_DEVICE_CLASS_HID_KEYBOARD, &hid_tusb_cfg);
#if CONFIG_TINYUSB_CDC_ENABLED
    if (err == ERROR_NONE) {
        install_cdc_console();
    }
#endif
    return err;
}

static error_t hid_device_stop(struct Device* device) {
#if CONFIG_TINYUSB_CDC_ENABLED
    uninstall_cdc_console();
#endif
    auto* controller = device_get_parent(device);
    return usb_device_controller_release(controller, USB_DEVICE_CLASS_HID_KEYBOARD);
}

static error_t hid_device_set_name(struct Device* device, const char* name) {
    (void)device;
    if (name == nullptr) {
        custom_name[0] = '\0'; // clear override, fall back to the mode's default name
        return ERROR_NONE;
    }
    strncpy(custom_name, name, sizeof(custom_name) - 1);
    custom_name[sizeof(custom_name) - 1] = '\0';
    return ERROR_NONE;
}

// tud_hid_report() fails outright (no queueing) if the endpoint is still busy sending a
// previous report - a single fire-and-forget call is unsafe whenever a caller sends two reports
// back to back (e.g. press immediately followed by release, as every button handler in
// UsbTest/Tab5KeyboardHID does): the second call can lose the race and drop the release, leaving
// the host thinking a key/button/consumer-control is still held down (which then either does
// nothing further or, for keys the host auto-repeats, keeps repeating). Retry with a short
// backoff instead of failing immediately, same fix as Tab5KeyboardHID's own sendWithRetry()
// needed at the app layer before this existed - moved down into the driver so every caller
// gets it automatically instead of reimplementing it.
static error_t hid_send_report(uint8_t report_id, const uint8_t* report, size_t len) {
    if (!tud_mounted()) {
        LOG_W(TAG, "hid_send_report(id=%d): tud_mounted() false - real disconnect, not just a busy endpoint", report_id);
        return ERROR_INVALID_STATE;
    }
    for (int attempt = 0; attempt < 10; attempt++) {
        if (tud_hid_ready() && tud_hid_report(report_id, report, static_cast<uint16_t>(len))) {
            return ERROR_NONE;
        }
        vTaskDelay(pdMS_TO_TICKS(5));
    }
    LOG_W(TAG, "hid_send_report(id=%d): gave up after 10 retries (~50ms) - endpoint stayed busy/not-ready the whole time", report_id);
    return ERROR_RESOURCE;
}

static error_t hid_device_send_keyboard(struct Device* device, const uint8_t* report, size_t len) {
    (void)device;
    if (active_mode != USB_HID_DEVICE_MODE_KEYBOARD && active_mode != USB_HID_DEVICE_MODE_KEYBOARD_MOUSE) {
        return ERROR_NOT_SUPPORTED;
    }
    uint8_t buf[8] = {};
    memcpy(buf, report, len < sizeof(buf) ? len : sizeof(buf));
    return hid_send_report(REPORT_ID_KEYBOARD, buf, sizeof(buf));
}

static error_t hid_device_send_consumer(struct Device* device, const uint8_t* report, size_t len) {
    (void)device;
    if (active_mode != USB_HID_DEVICE_MODE_KEYBOARD && active_mode != USB_HID_DEVICE_MODE_KEYBOARD_MOUSE) {
        return ERROR_NOT_SUPPORTED;
    }
    uint8_t buf[2] = {};
    memcpy(buf, report, len < sizeof(buf) ? len : sizeof(buf));
    return hid_send_report(REPORT_ID_CONSUMER, buf, sizeof(buf));
}

static error_t hid_device_send_mouse(struct Device* device, const uint8_t* report, size_t len) {
    (void)device;
    uint8_t report_id;
    if (active_mode == USB_HID_DEVICE_MODE_MOUSE) {
        report_id = REPORT_ID_MOUSE_SOLO;
    } else if (active_mode == USB_HID_DEVICE_MODE_KEYBOARD_MOUSE) {
        report_id = REPORT_ID_MOUSE_COMBO;
    } else {
        return ERROR_NOT_SUPPORTED;
    }
    uint8_t buf[4] = {};
    memcpy(buf, report, len < sizeof(buf) ? len : sizeof(buf));
    return hid_send_report(report_id, buf, sizeof(buf));
}

