ByteWelder/Tactility/Platforms/platform-esp32/source/drivers/usb/esp32_usb_hid_device.cpp
static error_t hid_device_send_gamepad(struct Device* device, const uint8_t* report, size_t len) {
    (void)device;
    if (active_mode != USB_HID_DEVICE_MODE_GAMEPAD) {
        return ERROR_NOT_SUPPORTED;
    }
    uint8_t buf[8] = {};
    memcpy(buf, report, len < sizeof(buf) ? len : sizeof(buf));
    return hid_send_report(REPORT_ID_GAMEPAD, buf, sizeof(buf));
}

static bool hid_device_is_connected(struct Device* device) {
    (void)device;
    // tud_hid_ready() deliberately NOT included here: it reflects whether the endpoint is idle
    // right now (false during every in-flight report send, which is normal and momentary, not
    // a disconnect), not whether a host is actually connected. Including it made this function
    // flap constantly under any traffic - explains the "Connected" <-> "waiting for host..."
    // flicker apps were seeing on every keypress/click even though nothing was actually wrong
    // (hid_send_report()'s own retry logic was succeeding the whole time; no warning ever
    // logged because there was nothing to warn about). tud_mounted() alone is the correct
    // "is a host connected" signal.
    return tud_mounted();
}

extern const UsbHidDeviceApi esp32_usb_hid_device_api = {
    .start         = hid_device_start,
    .stop          = hid_device_stop,
    .set_name      = hid_device_set_name,
    .send_keyboard = hid_device_send_keyboard,
    .send_consumer = hid_device_send_consumer,
    .send_mouse    = hid_device_send_mouse,
    .send_gamepad  = hid_device_send_gamepad,
    .is_connected  = hid_device_is_connected,
};

// ---- Driver lifecycle ----
// Defined in each board's .dts as a child of usbdevice0 (e.g. usbdevicehid0) - the devicetree
// compiler wires device_get_parent() to the controller automatically.

extern "C" {

static error_t start_device(struct Device* device) {
    (void)GET_CONFIG(device); // no configuration - placeholder only
    return ERROR_NONE;
}

static error_t stop_device(struct Device* device) {
    // Safety cleanup: release the slot if it's still held (e.g. this device is stopped while
    // HID is still active).
    auto* controller = device_get_parent(device);
    if (controller != nullptr && usb_device_controller_get_active_class(controller) == USB_DEVICE_CLASS_HID_KEYBOARD) {
#if CONFIG_TINYUSB_CDC_ENABLED
        uninstall_cdc_console();
#endif
        usb_device_controller_release(controller, USB_DEVICE_CLASS_HID_KEYBOARD);
    }
    return ERROR_NONE;
}

Driver esp32_usb_hid_device_driver = {
    .name         = "esp32_usb_hid_device",
    .compatible   = (const char*[]) { "espressif,esp32-usbdevice-hid", nullptr },
    .start_device = start_device,
    .stop_device  = stop_device,
    .api          = &esp32_usb_hid_device_api,
    .device_type  = &USB_HID_DEVICE_TYPE,
    .owner        = nullptr,
    .internal     = nullptr,
};

} // extern "C"

#endif // CONFIG_SOC_USB_OTG_SUPPORTED && CONFIG_TINYUSB_HID_COUNT
